proyectoDevise/app/controllers/user/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (nick = 'dani') LIMIT 1
---
  def create
    self.resource = warden.authenticate!(auth_options)
    set_flash_message(:notice, :signed_in) if is_navigational_format?
    sign_in(resource_name, resource)

    #Its a valid user, so the invalid_user variable is actualize
    @invalid_user = 0

    cookies[:nickname] = resource.nick
    @user = User.find_by_nick(cookies[:nickname])